<?php

namespace App\Services;

trait RandomStrings{
    private function getActionRand() : String {
        $words = [
            "인사하는",
            "하트뽀뽀",
            "점프하는",
            "달리는",
            "하늘 나는",
            "방방뛰는",
            "신나는",
            "즐거운",
            "슬픈",
            "질투하는",
            "사랑스런",
            "사랑하는",
            "폭 안기는",
            "예쁜",
            "조그마한",
        ];
        $key = array_rand($words);
        return $words[$key];
    }
    private function getColorRand() : String {
        $words = [
            "빨간",
            "노란",
            "초록의",
            "파란",
            "푸른",
            "붉은",
            "어두운",
            "밝은",
            "까만",
            "하얀",
            "알록달록"
        ];
        $key = array_rand($words);
        return $words[$key];
    }
    private function getStrRand() : String {
        $words = [
            "머리",
            "눈",
            "입술",
            "피부",
            "손톱",
            "네일",
        ];
        $key = array_rand($words);
        return $words[$key];
    }
    private function getNameRand() : String {
        $words = [
            "사자", "물범", "표범", "호랑이", "캥거루", "코알라", "고니", "하마", "토끼", "쥐",
            "판다", "원숭이", "꿩", "말", "거북이", "얼룩말", "늑대", "침팬지", "낙타", "버팔로", "물소", "치타", "고양이", "악어", "암소", "고릴라", "기린","거위",
            "햄스터","수달","순록","물개","코뿔소","다람쥐","도마뱀","사슴","펭귄","딱따구리","앵무새","부엉이","고슴도치","여우","사막여우","개구리","두꺼비","타조",
            "당나귀","돼지","돌고래","상어","비둘기","염소","양","오리","닭","병아리","독수리","매","갈매기","백조","까치","까마귀","곰","하이에나","두더지","나무늘보","귀뚜라미","나비","나방",
            "달팽이","고래","북극곰","사마귀","스컹크","이구아나","퓨마","코끼리","파리","모기","오랑우탄","아나콘다","올챙이","박쥐","플라밍고"
        ];
        $key = array_rand($words);
        return $words[$key];
    }
}
